package com.example.androidclient.comment;

public class interviews {
    public static String[] content=new String[]{
            "比如这道题里说答案可能很大，所以需要对 10e9 + 7 取余 后返回。\n" +
                    "这里是我写的代码，为什么返回结果时需要(sum+mod)%mod，直接sum%mod，就不对，对取模一直很疑惑",
            "上班做上周周赛题，4道题第一次都独立做出来了，发个帖纪念一下",
            "觉得自己代码能力很弱，找几个简单的试试水……然后就翻车了……\n" +
                    "\n" +
                    "槽点的确有点多……而且看的头大如斗……",
            "问了个数组内第k大的数，第一反应想到基于快排的快速选择。但是比较紧张，手撕的时候有点迷糊，为了能完成，还是写了遍历k遍取第k大的数。\n" +
                    "好难，一段时间不刷就手生了……",
            "可以利用一个有七个数大顶堆，然后一个个遍历后面的数比堆中最小的数大就保存，最后输出堆中第七个数。可以一次遍历就成功。",
            "高薪聘请2021/2022届本/硕/博\n" +
                    "\n" +
                    "数学、物理、统计、计算机、软件等专业\n" +
                    "\n" +
                    "通过这里找到我\n" +
                    "\n" +
                    "SLam_Pan\n" +
                    "\n" +
                    "1、量化软件开发工程师\n" +
                    "\n" +
                    "(本科211以上，硕士学位)base北上杭深\n" +
                    "\n" +
                    "关键词:c++、python、java软件开发\n" +
                    "\n" +
                    "年40-70万 奖金+福利\n" +
                    "\n" +
                    "有软件开发相关工作或实习经验优先!",
            "第一题挺简单，第二题不会，直接跳第三天整了好久模拟出来了，第四题是滑雪那道题的变体，那题前几天整好写过，第二次打周赛终于进前一千了，不过调试水平不行，墨迹好久才ac导致时间有点长，再接再厉",
            "确实，这打周赛可比游戏好玩多了",
            "跪求1-2位女生一起刷leecode\n" +
                    "\n" +
                    "一个人没有自制力\n" +
                    "\n" +
                    "小小的愿望是每天5道题\n" +
                    "\n" +
                    "希望姐妹们可以监督我",
            "女同程序员，打拳的主力部队"


    };
}
